RIET/src/InformationRegisters/AUsПолучателиУведомленийКС/AUsПолучателиУведомленийКС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AUsПолучателиУведомленийКС</name>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УровеньУведомленийКС</name>
    <type>
      <types>CatalogRef.УровниУведомленийКС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/AUsПолучателиУведомленийКС/ManagerModule.bsl
Процедура ДобавитьЗаписиДляНовогоAU(AU) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	AUsПолучателиУведомленийКС.УровеньУведомленийКС,
	|	AUsПолучателиУведомленийКС.Получатель
	|ИЗ
	|	РегистрСведений.AUsПолучателиУведомленийКС КАК AUsПолучателиУведомленийКС
	|ГДЕ
	|	AUsПолучателиУведомленийКС.AU.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", СокрЛП(AU));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейAU = РегистрыСведений.AUsПолучателиУведомленийКС.СоздатьНаборЗаписей();
	НаборЗаписейAU.Отбор.AU.Установить(AU);
	
	Для Каждого Стр из РезультатЗапроса Цикл 
		
		Запись = НаборЗаписейAU.Добавить();
		Запись.AU = AU;
		Запись.УровеньУведомленийКС = Стр.УровеньУведомленийКС;
		Запись.Получатель = Стр.Получатель;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписейAU.Записать();
	Исключение
		РГСофт.СообщитьИЗалоггировать(
		"Не удалось записать получаетелей уведомлений КС для AU " + СокрЛП(AU),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.РегистрыСведений.AUsПолучателиУведомленийКС,
		Неопределено,
		ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
